#pragma once

//1) Добавить к классу MyString(см.предыдущие ДЗ) перегрузку оператора присваивания, реализующую глубокое копирование.
// 
//2) Добавить к классу MyString перегрузку операторов ++ в постфиксной форме
//(добавление к концу нашего объекта - строки одного символа 'x') и -- в постфиксной форме(удаление одного символа 
//из конца нашего объекта - строки).
// 
//3) Добавить к классу Contact(см.предыдущие ДЗ, приложение "Телефонная книга") перегрузку оператора 
// присваивания, реализующую глубокое копирование.
